Revit 2027 API
Concrete Properties
The Concrete type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "Concrete" schema.
CommonTintToggle |  The property labeled "Tint" from the "Concrete" schema.
ConcreteBmMap |  The property labeled "Image" from the "Concrete" schema.
ConcreteBrightmode |  The property labeled "Weathering" from the "Concrete" schema.
ConcreteBumpAmount |  The property labeled "Amount" from the "Concrete" schema.
ConcreteBumpMap |  The property labeled "Image" from the "Concrete" schema.
ConcreteColor |  The property labeled "Color" from the "Concrete" schema.
ConcreteFinish |  The property labeled "Type" from the "Concrete" schema.
ConcreteSealant |  The property labeled "Sealant" from the "Concrete" schema.
Top
See Also
Reference
Concrete Class
Autodesk.Revit.DB.Visual Namespace